In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import 
import scipy
from scipy.stats import norm
from scipy import stats
from statsmodels.stats.proportion import proportions_ztest
from statsmodels.stats.multicomp import pairwise_tukeyhsd
from statsmodels.stats.multicomp import MultiComparison

In [3]:
UKprisons = pd.read_excel("New/UKDATA/CBP-04334-PUBLIC.xlsx")

In [8]:
UKprisons2=pd.read_excel("New/UKDATA/CBP-04334-PUBLIC.xlsx", sheet_name="1.02")

In [16]:
UKprisons1=pd.read_clipboard()

## Prison population per 100,000 inhabitants
### By first year of decade; England and Wales

In [17]:
UKprisons1

    Year  Males  Females  Total
0   1901    152       27      86
1   1911    145       19      79
2   1921     84       10      44
3   1931     76        5      38
4   1941     64        6      33
5   1951    129        6      64
6   1961    166        5      82
7   1971    218        5     107
8   1981    226        7     112
9   1991    227        7     112
10  2001    314       17     160
11  2011    369       18     189
12  2021    316       13     159

In [14]:
UKprisons3=pd.read_clipboard()

In [ ]:
UKprisons3

               Year   Males Females   Total % females
0              1900  14,459   2,976  17,435       17%
1              1901  15,868   3,112  18,980       16%
2              1902  16,240   3,197  19,437       16%
3              1903  17,418   3,377  20,795       16%
4              1904  18,167   3,261  21,428       15%
..              ...     ...     ...     ...       ...
118            2018  79,449   3,846  83,295        5%
119            2019  79,140   3,795  82,935        5%
120            2020  77,004   3,362  80,366        4%
121            2021  75,353   3,183  78,536        4%
122  2022 (YE June)  76,226   3,216  79,442        4%

[123 rows x 5 columns]

In [ ]:
dict_df = pd.read_excel('c:/apps/courses_schedule.xlsx', 
                   sheet_name=['Technologies','Schedule'])